{
  "education": [
    {
      "awards_achievements": [
        "Member of Dean's Honour Roll (2017)"
      ],
      "degree": "Bachelor of Arts. Computer Science.",
      "department": "Lassonde School of Engineering",
      "duration": "2013-2020",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BrianKim",
  "highlighted_projects": [
    {
      "description": "Built and published an Android app in Kotlin that reminds people who work/study from home to drink water, stretch and to move around to build healthier work/study habits during COVID-19. Utilized Android Services (AlarmManager) to implement background running timer and send Broadcasts to BroadcastReceivers that handle timer expire events. Utilized NotificationManger and NotificationBuilder to send custom Notifications to users upon termination, using PendingIntent to navigate users back into the app. Utilized ViewBinding and PreferenceManager to modify and persist user preferences in the app. Implemented third-party libraries such as CircularMaterialProgressBar for a modern UI look.",
      "git_url": "https://github.com/kimbrian94/Remindoo",
      "name": "Remindoo (Play Store App)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented an automating monitor agent which observes a cluster of Linux nodes/servers and records data from the nodes. The users are clusters of Linux servers internally connected by a switch that communicates through internal IPv4 addresses. This monitoring agent will capture the hardware specifications of each node through bash scripts and periodically insert node resource usage into a PostgreSQL RDBMS database that is containerized and ran in docker. Applying this monitoring agent and the data it collects, you can effectively solve important business problems involving resource planning such as increasing and decreasing the number of nodes depending on the servers' relative CPU/Memory usages. GitFlow is used as the branching model.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In progress.",
        "JDBC App: In progress.",
        "Grep App: Developed a Java Grep App on IntelliJ that implements the Linux grep string pattern searching utility that matches a regular expression. This app recursively searches a given directory using BufferedReader for lines that match the specified regular expression. When the matched lines are found with Pattern Matcher, they are written out to a file by a BufferedWritter. Exceptions and errors are handled by SLF4J framework, packaged with Maven, and containerized with Docker for easy access."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Brian Kim",
  "others": [
    {
      "bullets": [
        " "
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        " "
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        " "
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed, developed, and tested many applications while following the Software Development Life Cycle. Communicated in a team through Agile practices such as Daily Scrum, Sprint Retro, and Sprint Planning. Maintained source code version control through Git/GitHub, using GitFlow as a branching model. ",
      "duration": "2021-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "HTML/CSS/PHP",
      "Python",
      "Swift",
      "Kotlin",
      "JavaScript"
    ],
    "familiar": [
      "Firebase",
      "Model-View-ViewController",
      "C",
      "Objective-C",
      "Visual Basic"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub/GitFlow",
      "Docker"
    ]
  },
  "summary": "Some words that could describe me are 'persistent', 'critical thinking' and 'teamwork'. I'm a proficient Java developer and have developed Java/Kotlin applications that utilize SQL Database and Web Services following the software development lifecycle. I am a recent graduate from York University with a Bachelor of Computer Science. Not only I graduated with a deep understanding of CS fundamentals and programming skills, but I was also involved and acted as a staff of a student club called 'Youth With A Mission' which strengthened my ability to work in a team setting. Furthermore, I enhanced my coding skills and critical thinking through different programming contests and hackathons. I have a  great passion for immersing deep into the software industry because it is so ever-changing. Learning new technologies and applying them excites me as a software developer because it solidifies my skillset and helps me grow along with the industry without falling behind."
}
